{
  "home": {
    "title-h1": "Bem-vindo",
    "title-h2": "Eu sou Maciel Pinheiro",
    "subtitle-h2": "Um desenvolvedor Front-end & Web designer"
  },
  "nav": {
    "home": "Início",
    "experience": "Experiência",
    "projects": "Projetos",
    "about": "Sobre",
    "contact": "Contato"
  },

  "section-header-text": {
    "title_about": "Sobre Mim",
    "title_skill": "Habilidades",
    "title_project": "Projetos",
    "title_exp": "Experiências",
    "title_contact": "Contato"
  },

  "experience": {
    "date_1": "2016 - 2020",
    "date_2": "2020 - 2021",
    "date_3": "2022 - presente",

    "title_1": "Transição de Carreira",
    "description_1": "Iniciei minha transição de carreira de técnico em informática para web designer",

    "title_2": "Web Designer",
    "description_2": "Passei um ano como web designer freelancer antes de migrar para o desenvolvimento front-end, unindo minhas habilidades de design com expertise técnica",

    "title_3": "Desenvolvedor Front-End",
    "description_3": "Atualmente sou desenvolvedor Front-End trabalhando como freelancer. Meu stack inclui React, Next.js, TypeScript, Tailwind CSS e Framer Motion. Estou aberto a oportunidades em tempo integral."
  },

  "resume": {
    "download": "Baixar Currículo",
    "language_1": "Inglês",
    "language_2": "Português",
    "language_3": "Japonês"
  },
  "experiences": {
    "title-1": "Técnico de informática",
    "title-2": "Jornada de estudos",
    "title-3": "Desenvolvedor Front-end & Web designer",
    "dialog-text-1": "Estudei hardware por 2 anos e depois comecei a trabalhar montando PCs e fazendo manutenção",
    "dialog-text-2": "Foi aqui que comecei a mudar de carreira, mas continuei trabalhando com computadores. Estudei por 2 anos antes de começar a trabalhar como desenvolvedor.",
    "dialog-text-3": "Agora, trabalho como freelancer fazendo diferentes tipos de trabalho como sites completos e apps usando todas as tecnologias ao lado"
  },
  "project": {
    "tagline-1": "Projeto 01",
    "tagline-2": "Projeto 02",
    "title-h1-page": "Meus Projetos",
    "main-title": "Projeto E-commerce",
    "main-title-2": "Projeto Showcase",
    "main-page-subtitle": "Aqui estão meus últimos projetos e algumas informações sobre eles",
    "subtitle": "Aqui está um dos meus últimos projetos e algumas informações sobre ele",
    "title-h3": "Tecnologias utilizadas neste projeto",
    "info-text-1": "O projeto de e-commerce em Next.js é construído usando React, Next.js, TypeScript, Redux e Tailwind CSS. Ele possui um catálogo de produtos dinâmico buscado de uma API, com funcionalidades como filtragem por categorias, marcas e preços. A loja Redux gerencia o estado global, garantindo atualizações contínuas entre os componentes.",
    "info-text-2": "O Tailwind CSS é usado para um design de UI moderno e responsivo. O aplicativo inclui páginas para listagem de produtos, visualização detalhada de produtos, carrinho de compras e checkout, com atualizações em tempo real e desempenho otimizado para uma experiência de usuário fluida em todos os dispositivos.",
    "info-text-3": "O projeto de showcase em Next.js usa React, Next.js, TypeScript e Tailwind CSS. Ele apresenta um catálogo dinâmico de telefones, incluindo iPhone 15 e RedMagic 9 Pro. As páginas de showcase destacam as características únicas desses telefones com animações criadas usando Framer Motion.",
    "info-text-4": "O Tailwind CSS garante um design de UI moderno e responsivo em todos os dispositivos. O aplicativo inclui páginas de listagem de telefones, visualizações detalhadas, carrinho de compras e checkout, todos otimizados para desempenho. O Framer Motion oferece interações visualmente atraentes, aprimorando a experiência de compra.",
    "button-text": "Site Online"
  },
  "contact": {
    "main-title": "Contato",
    "subtitle": "Contato por Email",
    "name": "Nome",
    "email": "Email",
    "type": "Digite sua mensagem",
    "button": "Enviar Email",
    "social": "Mídia Social"
  },
  "about": {
    "title": "Sobre mim",
    "subtitle": "Olá, meu nome é Maciel Pinheiro. Sou brasileiro e tenho 26 anos.",
    "lorem": "Sou um desenvolvedor front-end e designer de web com 2 anos de experiência, especializado em criar interfaces visualmente atraentes e altamente funcionais. Tenho um conhecimento sólido de HTML, CSS e JavaScript, e expertise em tecnologias avançadas como React, Next.js, Tailwind CSS e TypeScript. Além disso, utilizo ferramentas de design web como WebFlow e Figma. Comprometido em entregar resultados de alta qualidade, estou pronto para agregar valor à sua equipe."
  }
}
