{
  "home": {
    "description": "Meu nome é Pedro, sou um desenvolvedor com mais de 2 anos de experiência construindo para a web.",
    "skills-h1": "Tecnologias",
    "skills-p": "Experiências",
    "skills-text": "Usando as tecnologia mais recente do mercado"
  },
  "nav": {
    "home": "Início",
    "skills": "Habilidades",
    "projects": "Projetos",
    "about": "Sobre",
    "contact": "Contato",
    "resume": "Currículo"
  },
  "experiences": {
    "title-1": "Técnico de informática",
    "title-2": "Jornada de estudos",
    "title-3": "Desenvolvedor Front-end & Web designer",
    "dialog-text-1": "Estudei hardware por 2 anos e depois comecei a trabalhar montando PCs e fazendo manutenção",
    "dialog-text-2": "Foi aqui que comecei a mudar de carreira, mas continuei trabalhando com computadores. Estudei por 2 anos antes de começar a trabalhar como desenvolvedor.",
    "dialog-text-3": "Agora, trabalho como freelancer fazendo diferentes tipos de trabalho como sites completos e apps usando todas as tecnologias ao lado"
  },
  "project": {
    "main-title": "Projeto E-commerce",
    "main-title-2": "Projeto Showcase",
    "subtitle": "Aqui está um dos meus últimos projetos e algumas informações sobre ele",
    "title-h3": "Tecnologias utilizadas neste projeto",
    "info-text-1": "O projeto de e-commerce em Next.js é construído usando React, Next.js, TypeScript, Redux e Tailwind CSS. Ele possui um catálogo de produtos dinâmico buscado de uma API, com funcionalidades como filtragem por categorias, marcas e preços. A loja Redux gerencia o estado global, garantindo atualizações contínuas entre os componentes.",
    "info-text-2": "O Tailwind CSS é usado para um design de UI moderno e responsivo. O aplicativo inclui páginas para listagem de produtos, visualização detalhada de produtos, carrinho de compras e checkout, com atualizações em tempo real e desempenho otimizado para uma experiência de usuário fluida em todos os dispositivos.",
    "info-text-3": "O showcase em Next.js usa React, Next.js, TypeScript e Tailwind CSS. Ele exibe um catálogo dinâmico de telefones, incluindo iPhone 15 e RedMagic 9 Pro. Páginas showcase apresentam animações criadas com Framer Motion, destacando características exclusivas. O Redux gerencia o estado global, garantindo atualizações em tempo real, com recursos de filtragem por marca, especificações e preço.",
    "info-text-4": "Tailwind CSS é usado para um design moderno e responsivo, adaptado para todos os dispositivos. O app inclui páginas de listagem de telefones, visualização detalhada, carrinho e checkout, otimizadas para desempenho. Framer Motion oferece interações visuais atraentes, melhorando a experiência de compra."
  },
  "contact": {
    "main-title": "Contato",
    "subtitle": "Contato por Email",
    "name": "Nome",
    "email": "Email",
    "type": "Digite sua mensagem",
    "button": "Enviar Email",
    "social": "Mídia Social"
  }
}
